import bg from "@/public/background-burnt-damaged-grunge.jpg";
import hanuman from "@/public/hanuman.jpg";
import Image from "next/image";

export default function Page() {
  return (
    <div className="relative text-center min-h-screen">
      {/* Background Image */}
      <div
        className="absolute inset-0 -z-10 w-full h-full bg-cover bg-center opacity-40"
        style={{ backgroundImage: `url(${bg.src})` }}
      ></div>

      {/* Content */}

      <main className=" bg-white bg-opacity-80 p-4 sm:p-8 rounded shadow-md mx-auto max-w-4xl">
        <h1 className="text-4xl mb-5 text-accent-400 font-medium">
          श्री हनुमान आरती
        </h1>
        <div className="flex justify-center items-center mb-8">
          <Image
            src={hanuman}
            alt="Lord Hanuman"
            className="rounded-lg"
            placeholder="blur"
          />
        </div>
        <h3 className="mb-5 text-accent-400 font-medium font-bold">दोहा</h3>

        <p className="text-primary-200 text-lg mb-10">
          श्रीगुरु चरन सरोज रज, निज मनु मुकुरु सुधारि ! <br />
          बरनऊं रघुबर बिमल जसु, जो दायकु फल चारि !! <br />
          बुद्धिहीन तनु जानिके, सुमिरौं पवन-कुमार ! <br />
          बल बुद्धि बिद्या देहु मोहिं, हरहु कलेस बिकार !!
        </p>

        <h3 className="mb-5 text-accent-400 font-medium font-bold">चौपाई</h3>

        <p className="text-primary-200 text-lg mb-10">
          जय हनुमान ज्ञान गुन सागर.. <br />
          जय कपीस तिहुं लोक उजागर॥ <br />
          <br />
          रामदूत अतुलित बल धामा। <br />
          अंजनि-पुत्र पवनसुत नामा ॥1॥ <br />
          <br />
          महाबीर बिक्रम बजरंगी। <br />
          कुमति निवार सुमति के संगी ॥2॥ <br />
          <br />
          कंचन बरन बिराज सुबेसा। <br />
          कानन कुंडल कुंचित केसा ॥3॥ <br />
          <br />
          हाथ बज्र औ ध्वजा बिराजै। <br />
          कांधे मूंज जनेऊ साजै॥4॥ <br />
          <br />
          संकर सुवन केसरीनंदन। <br />
          तेज प्रताप महा जग बन्दन ॥5॥ <br />
          <br />
          विद्यावान गुनी अति चातुर। <br />
          राम काज करिबे को आतुर ॥6॥ <br />
          <br />
          प्रभु चरित्र सुनिबे को रसिया। <br />
          राम लखन सीता मन बसिया ॥7॥ <br />
          <br />
          सूक्ष्म रूप धरि सियहिं दिखावा। <br />
          बिकट रूप धरि लंक जरावा ॥8॥ <br />
          <br />
          भीम रूप धरि असुर संहारे। <br />
          रामचंद्र के काज संवारे ॥9॥ <br />
          <br />
          लाय सजीवन लखन जियाये। <br />
          श्रीरघुबीर हरषि उर लाये ॥10॥ <br />
          <br />
          रघुपति कीन्ही बहुत बड़ाई। <br />
          तुम मम प्रिय भरतहि सम भाई ॥11॥ <br />
          <br />
          सहस बदन तुम्हरो जस गावैं। <br />
          अस कहि श्रीपति कंठ लगावैं ॥12॥ <br />
          <br />
          सनकादिक ब्रह्मादि मुनीसा। <br />
          नारद सारद सहित अहीसा ॥13॥ <br />
          <br />
          जम कुबेर दिगपाल जहां ते। <br />
          कबि कोबिद कहि सके कहां ते ॥14॥ <br />
          <br />
          तुम उपकार सुग्रीवहिं कीन्हा। <br />
          राम मिलाय राज पद दीन्हा ॥15॥ <br />
          <br />
          तुम्हरो मंत्र बिभीषन माना। <br />
          लंकेस्वर भए सब जग जाना ॥16॥ <br />
          <br />
          जुग सहस्र जोजन पर भानू। <br />
          लील्यो ताहि मधुर फल जानू ॥17॥ <br />
          <br />
          प्रभु मुद्रिका मेलि मुख माहीं। <br />
          जलधि लांघि गये अचरज नाहीं ॥18॥ <br />
          <br />
          दुर्गम काज जगत के जेते। <br />
          सुगम अनुग्रह तुम्हरे तेते ॥19॥ <br />
          <br />
          राम दुआरे तुम रखवारे। <br />
          होत न आज्ञा बिनु पैसारे ॥20॥ <br />
          <br />
          सब सुख लहै तुम्हारी सरना। <br />
          तुम रक्षक काहू को डर ना ॥21॥ <br />
          <br />
          आपन तेज सम्हारो आपै। <br />
          तीनों लोक हांक तें कांपै ॥22॥ <br />
          <br />
          भूत पिसाच निकट नहिं आवै। <br />
          महाबीर जब नाम सुनावै ॥23॥ <br />
          <br />
          नासै रोग हरै सब पीरा। <br />
          जपत निरंतर हनुमत बीरा ॥24॥ <br />
          <br />
          संकट तें हनुमान छुड़ावै। <br />
          मन क्रम बचन ध्यान जो लावै ॥25॥ <br />
          <br />
          सब पर राम तपस्वी राजा। <br />
          तिन के काज सकल तुम साजा ॥26॥ <br />
          <br />
          और मनोरथ जो कोई लावै। <br />
          सोइ अमित जीवन फल पावै ॥27॥ <br />
          <br />
          चारों जुग परताप तुम्हारा। <br />
          है परसिद्ध जगत उजियारा ॥28॥ <br />
          <br />
          साधु-संत के तुम रखवारे। <br />
          असुर निकंदन राम दुलारे ॥29॥ <br />
          <br />
          अष्ट सिद्धि नौ निधि के दाता। <br />
          अस बर दीन जानकी माता ॥30॥ <br />
          <br />
          राम रसायन तुम्हरे पासा। <br />
          सदा रहो रघुपति के दासा ॥31॥ <br />
          <br />
          तुम्हरे भजन राम को पावै। <br />
          जनम-जनम के दुख बिसरावै ॥32॥ <br />
          <br />
          अन्तकाल रघुबर पुर जाई। <br />
          जहां जन्म हरि-भक्त कहाई ॥33॥ <br />
          <br />
          और देवता चित्त न धरई। <br />
          हनुमत सेइ सर्ब सुख करई ॥34॥ <br />
          <br />
          संकट कटै मिटै सब पीरा। <br />
          जो सुमिरै हनुमत बलबीरा ॥35॥ <br />
          <br />
          जै जै जै हनुमान गोसाईं। <br />
          कृपा करहु गुरुदेव की नाईं ॥36॥ <br />
          <br />
          जो सत बार पाठ कर कोई। <br />
          छूटहि बंदि महा सुख होई ॥37॥ <br />
          <br />
          जो यह पढ़ै हनुमान चालीसा। <br />
          होय सिद्धि साखी गौरीसा ॥38॥ <br />
          <br />
          तुलसीदास सदा हरि चेरा। <br />
          कीजै नाथ हृदय मंह डेरा ॥39॥ <br />
          <br />
        </p>

        <h3 className="mb-5 text-accent-400 font-medium font-bold">दोहा</h3>

        <p className="text-primary-200 text-lg mb-10">
          पवन तनय संकट हरन, मंगल मूरति रूप। <br />
          राम लखन सीता सहित, हृदय बसहु सुर भूप ॥
        </p>
      </main>
    </div>
  );
}
